{
    "basic_info": {
      "description_header": "Xin chào",
      "description": "Tôi là Quân Nghiêm  tôi là một kỹ sư phần mềm. Với niềm đam mê về phát triển cả phía giao diện người dùng và phía máy chủ, tôi đã tích lũy được một bộ kỹ năng toàn diện cho phép tôi giải quyết các ứng dụng web phức tạp từ đầu đến cuối. Sở thích hiện tại của tôi là phát triển và xuất bản các Software Development Kit (SDKs).",
      "descriptionArray": [
        "My name is Quan Nghiem, and I am a passionate full stack software engineer. With a deep love for both front-end and back-end development, I strive to create exceptional user experiences while ensuring robust and efficient server-side functionality.",
        "On the front-end, I excel in building responsive and intuitive user interfaces using modern web technologies such as HTML5, CSS3, and Typescript. I have hands-on experience with popular front-end frameworks like React and Angular, enabling me to create dynamic and interactive web applications.",
        "When it comes to the back-end, I possess a strong foundation in server-side programming, database management, and cloud implementation. I have built RESTful APIs using ExpressJS and AWS lambdas, implemented authentication and authorization systems, and optimized database queries to ensure optimal performance.",
        "What truly sets me apart is my ability to seamlessly connect the front-end and back-end components, creating a cohesive and seamless user experience. I have a solid understanding of API design principles and can effectively integrate various third-party services and APIs into my applications.",
        "In addition to my technical skills, I am a strong advocate for clean code, modular architecture, and best practices in software development. I am also a champion of thorough testing and errors logging for my product as well as a robust system to ensure continuos development and integration. I have experience working in agile development environments, collaborating with cross-functional teams to deliver high-quality projects within deadlines.",
        "Thank you for taking the time to learn a bit about me. I look forward to connecting with you and discussing how we can work together to bring your ideas to life. Let's build something great!"
      ],
      "section_name": {
        "about": "About Me",
        "projects": "Dự Án",
        "skills": "Kĩ Năng",
        "experience": "Kinh Nghiệm"
      }
    },
    "projects": [
      {
        "title": "Animal Shelter",
        "startDate": "2020",
        "description": "Najbardziej rozbudowana aplikacja nad którą miałam okazję pracować. Poznałam dużo technologii a mój kod by sprawdzany przez super opiekuna. Aplikacja obsługuje wszystkie procesy adopcji i pozwala na przechowywanie wszelkiej dokumentacji związanej z adopcją zwierząt ze schroniska.",
        "images": [
          "images/portfolio/animal-shelter/p1.jpg",
          "images/portfolio/animal-shelter/p2.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Photography",
        "startDate": "2018",
        "description": "Osobisty projekt na przedmiot ze studiów. Byłam odpowiedzilna za testowanie aplikacji, która optymalizuje zdjęcia z pomocą popularnych algorytmów używanych przed edytory grafiki takie jak Pixlr czy Adobe Photoshop. Otrzymałam 5-tkę za projekt :)",
        "images": [
          "images/portfolio/photography/p1.jpg",
          "images/portfolio/photography/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "3D Object Viewer",
        "startDate": "2015",
        "description": "Jedna z pierwszych aplikacji nad którymi pracowałam na stażu. Musiałam przygotować front-end dla aplikacji, która pokazuje modele 3D znanych budynków. To był także mój pierwszy projekt w frameworku Angular. Dużo się nauczyłam!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Taxbit",
        "title": "Full Stack Engineer",
        "years": "06.2022 - 06.2023",
        "mainTech": [
          "React Typescript"
        ],
        "icon": "fab fa-react experience-icon",
        "technologies": [
          "REST API",
          "Typescript",
          "AWS",
          "Datadog",
          "Ramda",
          "NoSQL",
          "CircleCi",
          "Bitbucket"
        ]
      },
      {
        "company": "Citigroup",
        "title": "Full Stack Engineer",
        "years": "08.2020 - 05.2022",
        "mainTech": [
          "Angular 11"
        ],
        "icon": "fab fa-angular experience-icon",
        "technologies": [
          "Typescript",
          "Oracle",
          "Jenkins",
          "Bitbucket",
          "ExpressJS",
          "SQL"
        ]
      }
    ]
  }